src/cf/InformationRegisters/ОсновныеДоговорыКонтрагента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОсновныеДоговорыКонтрагента</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/ВидыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыДоговоровКонтрагентов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СПоставщиком</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СПокупателем</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентом</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионером</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомитентомНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СКомиссионеромНаЗакупку</Name>
					<Comment>Используется для обмена с типовыми конфигурациями</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатПредметыДоговоровКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатПредметыДоговоровКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевозка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Такси</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеУслуги</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/ДоговорыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ДоговорыКонтрагентов</Name>
			<Comment>(Общ)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаВзаиморасчетов</Name>
					<Comment>(Общ) Определяет валюту взаиморасчетов по договору, не может меняться, если по договору проведен хотя бы один документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВедениеВзаиморасчетов</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВедениеВзаиморасчетовПоДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидВзаиморасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыВзаиморасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДоговора</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРеализацииУПД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДопустимаяСуммаЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьПроведениеПриЗадолженности</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Служебный, для объединения с УТ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьСуммуЗадолженности</Name>
					<Comment>(Упр) </Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОплатаПоКурсуНаДатуСчета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ) </Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланированиеОбъемовПеревозок</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПредметыДоговоровКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредметДоговораПеревозки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатПредметыДоговоровПеревозки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РасчетыВУсловныхЕдиницах</Name>
					<Comment>(Регл)</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДокументаЗаказЗаявка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЦен</Name>
					<Comment>(Общ) Тип цен по умолчанию для оформления покупок по данному договору</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦенНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяДепозит</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидДокументаПоЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьВидСДПоЗадолженности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.уатВидыСопроводительныхДокументов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьДопустимоеЧислоДнейЗадолженности</Name>
					<Comment>Отсрочка оплаты по задолженности, дней</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьПроизводственныйКалендарь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьСпособРасчетаДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьУсловиеВозникновенияЗадолженности</Name>
					<Comment>0 - Предоплата, 1 - Доставка груза, 2 - Получение документов</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыСопроводительныхДокументов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыСопроводительныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УсловиеКонтроля</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатУсловияКонтроляСопроводительныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоДнейНаОбработку</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СпособРасчетаДней</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроизводственныйКалендарь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПунктНазначения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатПунктыНазначения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузополучатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГрафикОплаты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЭтапОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатЭтапыОплаты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВариантОтсчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.уатВариантыОтсчетаДатыПлатежа</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПроцент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСрок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьПроизводственныйКалендарь</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПроизводственныеКалендари</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьВидСопроводительногоДокумента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.уатВидыСопроводительныхДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/уатЗаполнениеДокументов/Ext/Module.bsl
#Область СлужебныеПроцедурыИФункции

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ЗАПОЛНЕНИЯ ДОКУМЕНТОВ

// Функция получает структуру параметров для получения договора покупки
//
// Возвращаемое значение:
//   Структура   – Структура со значением вида договора "С поставщиком"
//
Функция ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки()  Экспорт

	СтруктураПараметровДляПолученияДоговора = Новый Структура();

	СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПоставщиком);
	
	СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
	
	Возврат СтруктураПараметровДляПолученияДоговора;

КонецФункции // ПолучитьСтруктуруПараметровДляПолученияДоговораПокупки()

// Формирует структуру параметров для получения договора продажи со значениями по умолчанию.
//
// Возвращаемое значение:
//   Структура – структура параметров для получения договора продажи.
//
Функция ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи()  Экспорт

	СтруктураПараметровДляПолученияДоговора = Новый Структура();

	СписокДопустимыхВидовДоговоров = Новый СписокЗначений();
	СписокДопустимыхВидовДоговоров.Добавить(Перечисления.ВидыДоговоровКонтрагентов.СПокупателем);
	
	СтруктураПараметровДляПолученияДоговора.Вставить("СписокДопустимыхВидовДоговоров", СписокДопустимыхВидовДоговоров);
	Возврат СтруктураПараметровДляПолученияДоговора;

КонецФункции // ПолучитьСтруктуруПараметровДляПолученияДоговораПродажи()

// Функция возвращает основной договор контрагента
//
// Параметры
//  Контрагент  – Ссылка на справочник контрагентов
//	ВидДоговора - значение перечисления или массив/список значений
//
// Возвращаемое значение:
//   Ссылка на справочник договоры контрагентов
//
Функция ПолучитьОсновнойДоговорКонтрагента(Контрагент, Знач ВидДоговора = Неопределено,
	Знач Организация = Неопределено, Знач Валюта = Неопределено, Знач ПредметДоговора = Неопределено) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
	|	ДоговорыКонтрагентов.Ссылка КАК ДоступныйДоговорКонтрагента
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ОсновныеДоговорыКонтрагента КАК ОсновныеДоговорыКонтрагента
	|		ПО ДоговорыКонтрагентов.Ссылка = ОсновныеДоговорыКонтрагента.Договор
	|			И ДоговорыКонтрагентов.Владелец = ОсновныеДоговорыКонтрагента.Контрагент
	|			И ДоговорыКонтрагентов.ВидДоговора = ОсновныеДоговорыКонтрагента.ВидДоговора
	|			И ДоговорыКонтрагентов.Организация = ОсновныеДоговорыКонтрагента.Организация
	|ГДЕ
	|	ДоговорыКонтрагентов.Владелец = &Контрагент
	|	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И (&Организация = НЕОПРЕДЕЛЕНО
	|			ИЛИ ДоговорыКонтрагентов.Организация = &Организация)
	|	И ДоговорыКонтрагентов.ВидДоговора В(&ВидДоговора)
	|	И (&Валюта = НЕОПРЕДЕЛЕНО
	|			ИЛИ ДоговорыКонтрагентов.ВалютаВзаиморасчетов = &Валюта)
	|	И ДоговорыКонтрагентов.ПредметДоговора В(&ПредметДоговора)
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВЫБОР
	|		КОГДА ОсновныеДоговорыКонтрагента.Договор ЕСТЬ NULL
	|			ТОГДА 1
	|		ИНАЧЕ 0
	|	КОНЕЦ");
	
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Организация", ?(ЗначениеЗаполнено(Организация), Организация, Неопределено));
	Запрос.УстановитьПараметр("Валюта", ?(ЗначениеЗаполнено(Валюта), Валюта, Неопределено));
	
	мсвВидДоговора = Новый Массив;
	Если ВидДоговора = Неопределено Тогда
		Для Каждого ТекВидДоговора Из Метаданные.Перечисления.ВидыДоговоровКонтрагентов.ЗначенияПеречисления Цикл
			мсвВидДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов[ТекВидДоговора.Имя]);
		КонецЦикла;
	Иначе
		Если ТипЗнч(ВидДоговора) = Тип("Массив") ИЛИ ТипЗнч(ВидДоговора) = Тип("СписокЗначений") Тогда
			мсвВидДоговора = ВидДоговора;
		Иначе
			Если ТипЗнч(ВидДоговора) = Тип("Строка") Тогда
				мсвВидДоговора.Добавить(Перечисления.ВидыДоговоровКонтрагентов[ВидДоговора]);
			Иначе
				мсвВидДоговора.Добавить(ВидДоговора);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	Запрос.УстановитьПараметр("ВидДоговора", мсвВидДоговора);
	
	Если ТипЗнч(ПредметДоговора) = Тип("Массив") Тогда
		Запрос.УстановитьПараметр("ПредметДоговора", ПредметДоговора);
	ИначеЕсли НЕ ЗначениеЗаполнено(ПредметДоговора) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "И ДоговорыКонтрагентов.ПредметДоговора В(&ПредметДоговора)", "");
	Иначе
		мсвПредметДоговора = Новый Массив;
		Если ТипЗнч(ПредметДоговора) = Тип("Строка") Тогда
			мсвСтрокПредметДоговора = СтрРазделить(ПредметДоговора, ",");
			Для Каждого ТекПредметДоговора Из мсвСтрокПредметДоговора Цикл
				мсвПредметДоговора.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов[СокрЛП(ТекПредметДоговора)]);
			КонецЦикла;
		Иначе
			мсвПредметДоговора.Добавить(ПредметДоговора);
		КонецЕсли;
		Запрос.УстановитьПараметр("ПредметДоговора", мсвПредметДоговора);
	КонецЕсли;
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.ДоступныйДоговорКонтрагента;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
	
КонецФункции // ПолучитьОсновнойДоговорКонтрагента()

// Функция возвращает вид договор контрагента по входящему документу
//
// Параметры:
//  МетаданныеДокумента - Метаданные - Метаданные документа или другого объекта
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.уатПредметыДоговоров, Массив - значение или массив значений вида договора
//
Функция ПолучитьВидДоговораКонтрагента(МетаданныеДокумента) Экспорт
	
	ДокументыПоставщик = "уатВозвратТоваров, уатДоверенность, уатЗаказПеревозчику_уэ, уатЗаказПоставщику,
		|уатЗаправкаГСМ, уатЗаявкаНаРемонт,
		|уатМаршрутныйЛист, уатОтчетСистемыПлатон, уатПоступлениеАгрегатов, уатПоступлениеТоваровУслуг, уатРемонтныйЛист,
		|уатСчетНаОплатуПоставщика, уатРасходныйКассовыйОрдер, уатСтраховойСертификат_уэ";
	ДокументыПокупатель = "уатАктКС3_стм, уатЗаказГрузоотправителя, уатПотребностьВПеревозке_уэ, уатРеализацияУслуг,
		|уатРекламация_уэ, уатСчетНаОплатуПокупателю, уатСчетФактураВыданный, уатТТД";
	
	Если СтрНайти(ДокументыПоставщик, МетаданныеДокумента.Имя) <> 0 Тогда
		ВидДоговора = "СПоставщиком";
	ИначеЕсли СтрНайти(ДокументыПокупатель, МетаданныеДокумента.Имя) <> 0 Тогда
		ВидДоговора = "СПокупателем";
	Иначе
		ВидДоговора    = Неопределено;
	КонецЕсли;
	
	Возврат ВидДоговора;
	
КонецФункции
	
// Функция возвращает предмет договор контрагента по входящему документу
//
// Параметры:
//  МетаданныеДокумента - Метаданные - Метаданные документа или другого объекта
// 
// Возвращаемое значение:
//  Строка, ПеречислениеСсылка.уатПредметыДоговоров, Массив - значение или массив значений предмета договора
//
Функция ПолучитьПредметДоговораКонтрагента(МетаданныеДокумента) Экспорт
	
	Рез = Неопределено;
	
	Если МетаданныеДокумента.Имя = "такАгентскийДоговор"
		ИЛИ МетаданныеДокумента.Имя = "такЗаказТакси" Тогда
		Рез = "Такси";
	ИначеЕсли МетаданныеДокумента.Имя = "такАрендаТС" Тогда
		Рез = "Аренда";
	ИначеЕсли МетаданныеДокумента.Имя = "уатЗаказГрузоотправителя"
		ИЛИ МетаданныеДокумента.Имя = "уатЗаказПеревозчику_уэ"
		ИЛИ МетаданныеДокумента.Имя = "уатМаршрутныйЛист"
		ИЛИ МетаданныеДокумента.Имя = "уатПотребностьВПеревозке_уэ"
		ИЛИ МетаданныеДокумента.Имя = "уатРеестрПеревозок"
		ИЛИ МетаданныеДокумента.Имя = "уатРекламация_уэ"
		ИЛИ МетаданныеДокумента.Имя = "уатСтраховойСертификат_уэ" Тогда
		Рез = "Перевозка";
	ИначеЕсли МетаданныеДокумента.Имя = "уатАктКС3_стм"
		ИЛИ МетаданныеДокумента.Имя = "уатВозвратТоваров"
		ИЛИ МетаданныеДокумента.Имя = "уатЗаявкаНаРемонт"
		ИЛИ МетаданныеДокумента.Имя = "уатПоступлениеАгрегатов"
		ИЛИ МетаданныеДокумента.Имя = "уатРемонтныйЛист" Тогда
		Рез = "ПрочиеУслуги";
	ИначеЕсли НЕ уатОбщегоНазначенияПовтИсп.ВариантПоставкиСТД()
		И (МетаданныеДокумента.Имя = "уатЗаправкаГСМ"
		ИЛИ МетаданныеДокумента.Имя = "уатТТД") Тогда
		Рез = Новый Массив;
		Рез.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.Перевозка);
		Рез.Добавить(Перечисления.уатПредметыДоговоровКонтрагентов.ПрочиеУслуги);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции 

#КонецОбласти
